# Задача 2.
# Добавьте в пакет, созданный на семинаре шахматный модуль. Внутри него напишите код, решающий задачу о 8 ферзях. 
# Известно, что на доске 8×8 можно расставить 8 ферзей так, чтобы они не били друг друга. 
# Вам дана расстановка 8 ферзей на доске, определите, есть ли среди них пара бьющих друг друга. 
# Программа получает на вход восемь пар чисел, каждое число от 1 до 8 - координаты 8 ферзей. 
# Если ферзи не бьют друг друга верните истину, а если бьют - ложь.

from queens import eigth_queens


len_queens = 8
queens = []
for _ in range(len_queens):
    x, y = map(int, input("Введите координаты ферзя от 1 до 8: ").split())
    queens.append((x, y))

print(eigth_queens(queens))
